<?php get_header(); ?>
<?php
    $cat = get_the_category();
    $cat = $cat[0];
?>
<div class="container_wrapper container_each_<?php echo $cat->category_nicename; ?>">
  <!-- <div class="udr_ttlimg">
    <div class="udr_ttlimg_inner"><img
        src="<?php bloginfo('template_directory'); ?>/img/<?php echo $cat->category_nicename; ?>_udrttl.png"
        alt="<?php echo $cat->category_nicename; ?>"></div>
  </div> -->
  <?php
    $term_id = get_queried_object_id();
    $term = get_term_by('id', $term_id, 'category');
  ?>
  <div class="about__pageHeader">
    <h1 class="pageHeaderHeading"><?php echo ucfirst($term->slug) ?><span
        class="pageHeaderJp"><?php echo single_term_title(); ?></span></h1>
  </div>
  <div class="container clearfix">
    <div class="contents">
      <?php
      if ($term->slug === 'booth') {
          ?>
      <h1 class="comingSoon">Coming Soon</h1>
      <?php
      } else {?>
      <div class="archive_info info_<?php echo $cat->category_nicename; ?>">
        <p>お金の各分野の第一線で活躍中のスペシャリストをお招きして、最新情報をお届けいたします。</p>
        <!-- <h1 class="comingSoon">Coming Soon</h1> -->
        <!-- <div class="info_link">
          <a href="" class="info_linkbtn">会場マップ</a>
          <a href="" class="info_linkbtn">タイムスケジュール</a>
        </div> -->
        <div class="archive_theme">
          <h3><img src="<?php bloginfo('template_directory'); ?>/img/theme_ttl.png" alt=""></h3>
          <img src="<?php bloginfo('template_directory'); ?>/img/money_cicle_chart.svg" alt="賢い女性になるためのお金のサイクル"
            class="archive__themeImage">
        </div>

        <!-- <div class="archive_beauty">
          <a href="<?php echo home_url(); ?>/speakers/jitsuko-okada/"><img src="<?php bloginfo('template_directory'); ?>/img/beauty01.png"></a>
          <a href="<?php echo home_url(); ?>/speakers/ayako-kakiuchi/"><img src="<?php bloginfo('template_directory'); ?>/img/beauty02.png"></a>
          <a href="<?php echo home_url(); ?>/speakers/sayaka-konishi/"><img src="<?php bloginfo('template_directory'); ?>/img/beauty03.png"></a>
          <a href="<?php echo home_url(); ?>/speakers/chabi/"><img src="<?php bloginfo('template_directory'); ?>/img/beauty04.png"></a>
          <a href="<?php echo home_url(); ?>/speakers/mayumi-muroya/"><img src="<?php bloginfo('template_directory'); ?>/img/beauty05.png"></a>
          <a href="<?php echo home_url(); ?>/speakers/kayoko-asai/"><img src="<?php bloginfo('template_directory'); ?>/img/beauty06.png"></a>
          <a href="<?php echo home_url(); ?>/speakers/akiko-yamamoto/"><img src="<?php bloginfo('template_directory'); ?>/img/beauty07.png"></a>
        </div>
        <div class="archive_diet">
          <a href="<?php echo home_url(); ?>/speakers/homi-takasugi/"><img src="<?php bloginfo('template_directory'); ?>/img/diet01.png"></a>
          <a href="<?php echo home_url(); ?>/speakers/matty/"><img src="<?php bloginfo('template_directory'); ?>/img/diet02.png"></a>
          <a href="<?php echo home_url(); ?>/speakers/mako/"><img src="<?php bloginfo('template_directory'); ?>/img/diet03.png"></a>
          <a href="<?php echo home_url(); ?>/speakers/yumiko-murata/"><img src="<?php bloginfo('template_directory'); ?>/img/diet04.png"></a>
          <a href="<?php echo home_url(); ?>/speakers/tomoko-banba/"><img src="<?php bloginfo('template_directory'); ?>/img/diet05.png"></a>
        </div>
        <div class="archive_trouble">
          <a href="<?php echo home_url(); ?>/speakers/kankoro/"><img src="<?php bloginfo('template_directory'); ?>/img/trouble04.png"></a>
          <a href="<?php echo home_url(); ?>/speakers/ruriko-tsushima/"><img src="<?php bloginfo('template_directory'); ?>/img/trouble05.png"></a>
          <a href="<?php echo home_url(); ?>/speakers/naoko-komuro/"><img src="<?php bloginfo('template_directory'); ?>/img/trouble06.png"></a>
          <a href="<?php echo home_url(); ?>/speakers/suiren/"><img src="<?php bloginfo('template_directory'); ?>/img/trouble07.png"></a>
          <a href="<?php echo home_url(); ?>/speakers/mayu-fuchigami/"><img src="<?php bloginfo('template_directory'); ?>/img/trouble08.png"></a>
        </div> -->

        <!-- </div> -->
        <div class="archive_title">
          <!-- <h3><img src="<?php bloginfo('template_directory'); ?>/img/<?php echo $cat->category_nicename; ?>_ttl.png" alt=""></h3> -->
          <h3><img src="<?php bloginfo('template_directory'); ?>/img/speakers_udrttl.png" alt=""
              class="archive__speakersHeading"></h3>
        </div>
        <!-- <p class="archive_mainsubtitle info_<?php echo $cat->category_nicename; ?>">講演は今、女性が最も気になる17の旬のテーマでお送りします。<br>
    各セッションの写真やタイトルをクリックすると、詳しい内容をご確認いただけます。講演は事前申込制ですので、お席の確保をご希望の方は<a href="https://ex-pa.jp/item/14406/s38069" target="_blank">こちら</a>よりお申し込みください。</p>
    <p class="info_<?php echo $cat->category_nicename; ?>"><font size=2>※予告なしに登壇者が変更する可能性もございます。</font></p>
    <div class="archive_banner_img01 info_<?php echo $cat->category_nicename; ?>">
      <a href="<?php echo home_url(); ?>/speakers/uno-kanda/">
        <img src="<?php bloginfo('template_directory'); ?>/img/slider4.png"/>
      </a> -->
      </div>
      <?php } ?>



      <div class="archive_tag tag_<?php echo $cat->category_nicename; ?>">
        <!-- <?php
          // パラメータを指定
          $args = array(
            // タグ名順で指定
              'orderby' => 'name',
              // 昇順で指定
              'order' => 'ASC'
          );
          $posttags = get_tags($args);

          if ($posttags) {
              echo ' <ul class="tag-list"> ';
              foreach ($posttags as $tag) {
                  echo '<li><a href="'. get_tag_link($tag->term_id) . '">' . $tag->name . '</a></li>';
              }
              echo ' </ul> ';
          }
        ?> -->
      </div>
      <section class="archive_all">
        <div class="archive__tagBlock">
          <h1 class="archive__tagName -earn">
            <svg id="_10" data-name=" 10" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 429.74 512.04"><title>icon_earn</title><path class="svg_earn" d="M429.12,131.28l-93.06-120a3.11,3.11,0,0,0-4.3-.54l-18,14L342.2,61.4a26.06,26.06,0,0,0,5.53-3.31L372.26,89.7l14.35,18.64h0a24.1,24.1,0,0,0-5.68,6.15,27,27,0,0,0-3.54,24.59,29.5,29.5,0,0,0,4.31,8.15l-61.48,47.64,32.12-.15,76.23-59.17A3.07,3.07,0,0,0,429.12,131.28Z"/><polygon class="svg_earn" points="230.27 133.79 230.26 133.79 230.26 133.79 230.17 133.66 211.34 148.26 205.96 141.34 224.57 126.91 224.66 126.84 224.66 126.84 224.78 126.74 219.94 120.52 210.57 127.74 209.4 128.63 204.96 131.33 204.89 116.98 204.8 103.46 204.8 96.26 204.83 95.21 204.8 95.23 204.8 95.16 204.73 95.24 204.73 95.08 192.51 104.61 192.59 123.59 192.59 125.97 192.67 132.43 192.67 133.83 192.64 134.04 184.83 131.97 182.6 131.35 164.23 126.59 156.63 132.43 151.94 135.96 152.01 136.04 151.94 136.12 173.15 141.65 187.06 145.34 187.42 145.4 187.63 145.53 172.96 156.94 172.89 157 172.89 157 172.76 157.09 177.6 163.32 196.43 148.72 201.73 155.64 182.98 170.23 187.62 176.29 187.65 176.33 187.65 176.33 187.75 176.46 206.58 161.86 218.95 177.84 228.39 170.52 228.42 170.49 228.42 170.49 228.55 170.39 216.1 154.4 234.93 139.8 230.27 133.79"/><path class="svg_earn" d="M68.17,196.28l15.23-.09h9.24l-.07-.1h.2l-3.62-4.69a27.72,27.72,0,0,0,4.92-38.88l141-109.35.1-.08a27.66,27.66,0,0,0,38.8,5L274,48l38.85,50.12.08.07a27.74,27.74,0,0,0-4.92,38.88l-41.77,32.41L232.89,195.2h.21l-.21.16,32.12-.15,89.88-69.7a3.14,3.14,0,0,0,.54-4.3l-93.06-120a3,3,0,0,0-4.2-.62l-.1.08L47.2,164.24a3.15,3.15,0,0,0-.54,4.31Z"/><polygon class="svg_earn" points="139.1 195.9 169.61 172.23 166.88 168.61 166.87 168.59 166.87 168.59 166.77 168.47 147.02 183.76 131.35 195.74 131.55 195.74 131.35 195.9 139.1 195.9"/><polygon class="svg_earn" points="235.39 121.21 278.57 87.72 279.07 87.34 279.07 87.34 279.19 87.25 276.27 83.56 233.17 116.98 232.6 117.42 232.6 117.42 232.47 117.52 235.39 121.21"/><path class="svg_earn" d="M217.31,392.41v.06a.6.6,0,0,0-.09-.15,11,11,0,0,0-2,4.53,12.73,12.73,0,0,0,2.16,10.53,11.52,11.52,0,0,0,2-4.54,12.74,12.74,0,0,0-1.42-9.29C217.71,393.18,217.54,392.77,217.31,392.41Z"/><path class="svg_earn" d="M266.74,365.11a4.13,4.13,0,0,0-4-4.07q-24-1.16-49.11-.92t-48.95,1.46a4.11,4.11,0,0,0-4,4.15c0,.15-.08.31-.08.46l.08,5.22.15,38.81a30.74,30.74,0,0,0,30.81,30.51l45-.23a30.84,30.84,0,0,0,30.43-30.82l-.23-38.8Zm-42,12.4A22.45,22.45,0,0,1,245,385.4a2.93,2.93,0,0,1-.77,4.38L241,391.7a3,3,0,0,1-3.54-.61A12.6,12.6,0,0,0,226.5,387h-1.23v.08h-.18a23,23,0,0,1,3.61,17.06,21.41,21.41,0,0,1-2.79,7.15c-.23.34-.38.75-.64,1.07h.06a.14.14,0,0,1-.08.15,13.38,13.38,0,0,0,2.53.23,12.82,12.82,0,0,0,9.68-4.45,2.82,2.82,0,0,1,3.54-.54l3.38,1.84a3.1,3.1,0,0,1,1.38,2,2.72,2.72,0,0,1-.62,2.31,22.16,22.16,0,0,1-17.28,8.29,21.23,21.23,0,0,1-10.53-2.53c-.08,0-.16.08-.23.08a22,22,0,0,1-10.38,2.61,22.5,22.5,0,0,1-17.36-8.15,2.74,2.74,0,0,1-.62-2.3,2.92,2.92,0,0,1,1.39-2l3.23-1.92a2.9,2.9,0,0,1,3.6.54,12.84,12.84,0,0,0,11.41,4.14h.76v-.08h.17a22,22,0,0,1-.61-24.54c.17-.23.27-.52.44-.74h0a.17.17,0,0,1,.08-.14,10,10,0,0,0-2.61-.31,13.55,13.55,0,0,0-9.69,4.46,2.79,2.79,0,0,1-3.53.61L190.05,390a2.92,2.92,0,0,1-1.38-1.92,3,3,0,0,1,.61-2.38,22.46,22.46,0,0,1,17.3-8.3,23.8,23.8,0,0,1,10.6,2.53c.07,0,.07,0,.16-.07a22.72,22.72,0,0,1,7.36-2.35Z"/><path class="svg_earn" d="M427,368.11l-.53-101.51a48.48,48.48,0,0,0-48.57-48l-56.63.31-32.13.15-55.21.28-32.12.15-90.45.54-24.66.08L48,220.34A48.37,48.37,0,0,0,0,268.91L.54,370.42l.08,20.21L1,455.87A56.56,56.56,0,0,0,57.8,512l313.45-1.69a56.55,56.55,0,0,0,56.17-56.79L427,388.32Zm-140.07,3.62h-.16l.16,37.81a50.52,50.52,0,0,1-50.18,50.79l-45,.23A50.49,50.49,0,0,1,141,410.38l-.23-37.88a1075.93,1075.93,0,0,0-108.6,12.25c-2,.33-4,.6-6,.93l-.07-20.1a1083.73,1083.73,0,0,1,118.79-13.22,24.11,24.11,0,0,1,18.67-10.68c16.37-.85,33.2-1.39,50-1.47s33.73.23,50,.93a24.21,24.21,0,0,1,18.83,10.52,1064.43,1064.43,0,0,1,119,11.92l.07,17.36v2.77A1049,1049,0,0,0,290.31,372c-1.15-.07-2.25-.17-3.4-.24ZM84.16,255a4.82,4.82,0,0,1,3.22,8.46L45,299.87a4.86,4.86,0,0,1-8-3.69L36.82,272a16.78,16.78,0,0,1,16.6-16.83Z"/></svg>
            稼ぐ
          </h1>
          <?php
            $tag_posts = get_posts(array(
                'post_type' => 'post',
                'tag'    => 'earn',
                'posts_per_page' => -1,
                'order' => 'ASC' // 昇順・降順
            ));
            global $post;
            ?>
          <div class="archive__speakerInfo">
            <?php if ($tag_posts): foreach ($tag_posts as $post): setup_postdata($post); ?>
            <div class="archive__speaker">
              <img src="<?php the_post_thumbnail_url(); ?>" class="archive__speakerImage" />
              <span class="archive__speakerPosition"><?php the_field('speaker_position'); ?></span>
              <p class="archive__speakerName"><?php the_field('speaker_name'); ?></p>
            </div>
            <?php endforeach; endif; wp_reset_postdata(); ?>
          </div>
        </div>
        <div class="archive__tagBlock">
          <h1 class="archive__tagName -save">
            <svg id="_10" data-name="10" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><title>icon_save</title><path class="svg_save" d="M308.92,82.1a5.08,5.08,0,0,0,5.86-3.7l7.62-29.32a5.07,5.07,0,0,0-3.95-6.24l-3.84-.74a5.05,5.05,0,0,0-6,4.34L304.85,76.5A5.06,5.06,0,0,0,308.92,82.1Z"/><path class="svg_save" d="M249.63,91.82A5.06,5.06,0,0,0,258,86.15L242.64,60a5.05,5.05,0,0,0-7.2-1.62l-3.24,2.19a5.06,5.06,0,0,0-1.16,7.3Z"/><path class="svg_save" d="M360.4,113.08l26.13-15.34a5.06,5.06,0,0,0,1.62-7.21L386,87.28a5.07,5.07,0,0,0-7.3-1.15l-23.93,18.59a5.06,5.06,0,0,0,5.67,8.36Z"/><path class="svg_save" d="M502.16,282.56l-.64-.88-.08-.08a45.35,45.35,0,0,1-11.12,7.12c-.08,0-.16.08-.24.16A54.91,54.91,0,0,1,484,291c-.08,0-.16.08-.24.08a49,49,0,0,1-15.68,1.73c-.18,0-.36,0-.54-.05a47.86,47.86,0,0,1-15.06-3.36c-.3-.16-.6-.24-.83-.38l0,0c9.28-12.16,12.07-28.32,7-44.07A22.06,22.06,0,0,0,416,245c-4.72,14.88-2.47,30.08,5.69,42,.47.71.86,1.42,1.33,2.13l0,0a46.58,46.58,0,0,1-13.19,3.44,3.42,3.42,0,0,0-.8.16,131.16,131.16,0,0,0-17.68-60.32,129.48,129.48,0,0,0-35.16-39.2c-.33-.25-.62-.54-.95-.79h0l-.13-.1a75.45,75.45,0,0,1-62.07,31.92l-2.09-.08a75.39,75.39,0,0,1-53.27-23.76A74.38,74.38,0,0,1,219.21,167H186.89c-13.52-13.6-30.48-28.16-66-39a9.49,9.49,0,0,0-8.72,1.52,9.67,9.67,0,0,0-3.68,8c.64,18.32,7.6,19.92,13.2,40.8a133.84,133.84,0,0,0-57,48.4c-8.16,12.56-30.4,19.76-47.6,21.2a18.5,18.5,0,0,0-13.44,7.52,19,19,0,0,0-3.28,15.2l11.52,52.71a34.31,34.31,0,0,0,33.68,27c6.24.08,9.12,1,10.24,1.44,11.44,33.44,24.32,54.23,61,68.39l8,27.2A22.75,22.75,0,0,0,147.45,470h24.08a22.82,22.82,0,0,0,22.72-22.73l8-17.36h56.07v17.36A22.77,22.77,0,0,0,281.05,470h24a22.76,22.76,0,0,0,22.71-22.73l8-27.36a110.42,110.42,0,0,0,54.64-48.39,1.75,1.75,0,0,1,.24-.4c1.28-2.32,2.48-4.64,3.68-7a2.4,2.4,0,0,1,.32-.64c1.12-2.4,2.24-4.88,3.28-7.44a1.14,1.14,0,0,1,.16-.48,160.74,160.74,0,0,0,10.56-45.28,61.38,61.38,0,0,0,22.08-5.61c2.24-.95,4.4-2.07,6.48-3.19h.08a.42.42,0,0,0,.32-.16,62.71,62.71,0,0,0,32.88,9.12c15,0,30-5,41.52-15.28ZM146.65,285a22.68,22.68,0,1,1,22.72-22.64A22.74,22.74,0,0,1,146.65,285Zm295.43-11a27.61,27.61,0,0,1-2.68,4.12,20.21,20.21,0,0,1-1.78,1.83l0,0c0,.05,0,.07-.05.1s-.17.19-.28.29a29,29,0,0,1-5.35-28.63c1.36-3.84,3.44-4.48,5.68-4.48s4.4.64,5.68,4.48A29,29,0,0,1,442.08,274.08Z"/><path class="svg_save" d="M240.83,146.63A52.18,52.18,0,1,0,294.4,95.87,52.17,52.17,0,0,0,240.83,146.63ZM274,123.4l6.89.18,8,11,1,1.34,2.66,3.68.59.89,0,0,.1.13.69-.81,3-3.67,1-1.29,8.55-10.56,4.54.12,6.51.4-3.73,4.47-6.05,7.49-4,5-2.39,2.81h.11l-.13.15,10.15.73,3,.08-.05,2-.38,3.59h0l-16.75-.45-.16,6.06v0h0v.16l17,.46-.05,2-.38,3.57h0l-16.55-.44h-.2L296.54,177l-8.64-.24.38-14.29v-.19l-17-.46.15-5.62,17,.47.16-6.09v-.18l-17-.45.16-5.63,8.35.23,5,.23-.07-.1h.2l-2.27-3.26-4-5.5-3.76-5.19L270,123.2Z"/></svg>
            貯める
          </h1>
          <?php
            $tag_posts = get_posts(array(
                'post_type' => 'post',
                'tag'    => 'save',
                'posts_per_page' => -1,
                'order' => 'ASC' // 昇順・降順
            ));
            global $post;
            ?>
          <div class="archive__speakerInfo">
            <?php if ($tag_posts): foreach ($tag_posts as $post): setup_postdata($post); ?>
            <div class="archive__speaker">
              <img src="<?php the_post_thumbnail_url(); ?>" class="archive__speakerImage" />
              <span class="archive__speakerPosition"><?php the_field('speaker_position'); ?></span>
              <p class="archive__speakerName"><?php the_field('speaker_name'); ?></p>
            </div>
            <?php endforeach; endif; wp_reset_postdata(); ?>
          </div>
        </div>
        <div class="archive__tagBlock">
          <h1 class="archive__tagName -use">
            <svg id="_2" data-name="2" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512.01 480.25"><title>icon_use</title><path class="svg_use" d="M206.9,111.19a11.24,11.24,0,1,0-11.25,11.25A11.25,11.25,0,0,0,206.9,111.19Z"/><path class="svg_use" d="M409.68,100a11.25,11.25,0,1,0,11.25,11.24A11.23,11.23,0,0,0,409.68,100Z"/><path class="svg_use" d="M174.24,138.53a24,24,0,0,0-30.35,15.39L99.68,248.69H71.53V79.75L44.29,97.91a30.33,30.33,0,0,0-11.8,15.18L3.42,229.88A60.65,60.65,0,0,0,6.6,277.47l48.15,94.62a50.61,50.61,0,0,1,3.5,37L37.46,480.25H146.4S166,363.16,173.78,330.44c10.69-44.8,14-69.88,3.64-108.22l12.23-53.34A24.06,24.06,0,0,0,174.24,138.53Z"/><path class="svg_use" d="M93.34,0V215.84l26.72-57.25a5.41,5.41,0,0,1-.55-.12V63.89a42.62,42.62,0,0,0,35.31-37.73H263.51c-24.55,16.65-41.12,48.44-41.12,85s16.57,68.39,41.12,85.06h-60l-6,26.16H512V0Zm219.2,159.83H292.79V136.16H261V118.91h31.8v-11.5l-3.09-4.82H261V85.22h17.52L264,62.56h19l19.73,30.72,19.77-30.72h18.95L326.82,85.22h17.52v17.37H315.62l-3.08,4.8v11.52h31.8v17.25h-31.8v23.67Zm173.3-1.36a42.7,42.7,0,0,0-35.35,37.78H341.81C366.37,179.58,383,147.78,383,111.19s-16.59-68.38-41.15-85H450.49a42.66,42.66,0,0,0,35.35,37.73Z"/></svg>
            使う
          </h1>
          <?php
            $tag_posts = get_posts(array(
                'post_type' => 'post',
                'tag'    => 'use',
                'posts_per_page' => -1,
                'order' => 'ASC' // 昇順・降順
            ));
            global $post;
            ?>
          <div class="archive__speakerInfo">
            <?php if ($tag_posts): foreach ($tag_posts as $post): setup_postdata($post); ?>
            <div class="archive__speaker">
              <img src="<?php the_post_thumbnail_url(); ?>" class="archive__speakerImage" />
              <span class="archive__speakerPosition"><?php the_field('speaker_position'); ?></span>
              <p class="archive__speakerName"><?php the_field('speaker_name'); ?></p>
            </div>
            <?php endforeach; endif; wp_reset_postdata(); ?>
          </div>
        </div>
        <div class="archive__tagBlock">
          <h1 class="archive__tagName -increase">
            <svg id="レイヤー_1" data-name="レイヤー 1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 87.38 79.21"><title>icon_increase</title><path class="svg_increase" d="M57,7.51,56,8.78l1.79,2.09H53c-.54-.58-1.08-1.13-1.6-1.64V8.5a6.55,6.55,0,0,0-.25-1.82h6.6Zm.27,14.07a11,11,0,0,1-2.59,8.8c-1.64,1.86-4.76,4.06-10.36,4.1H42.2L40,34.1h0a18.16,18.16,0,0,1-3.6-1.54h0a10.76,10.76,0,0,1-2.66-2.18,11.09,11.09,0,0,1-2.58-8.8c.48-4,4-9,7.27-12h0a3.81,3.81,0,0,1,1.1-3.84h0l-1.09-2A2.09,2.09,0,0,1,38.31,2,2,2,0,0,1,39.53.79a14.42,14.42,0,0,1,9.4,0A2,2,0,0,1,50.14,2,2.07,2.07,0,0,1,50,3.72L49,5.72h0a3.9,3.9,0,0,1,1.22,2.84,4.68,4.68,0,0,1,0,.53,4.21,4.21,0,0,1-.09.49h0c3.22,3,6.73,8,7.22,12Zm-16-13a.77.77,0,0,0,.7.83h4.56a.64.64,0,0,0,.37-.13.82.82,0,0,0,.31-.58V8.58A1,1,0,0,0,47,8a.63.63,0,0,0-.38-.26H42a.6.6,0,0,0-.53.3.84.84,0,0,0-.17.53ZM34,21.94c-.6,4.88,2.52,9.58,10.15,9.58s10.74-4.7,10.13-9.58c-.41-3.33-3.78-7.89-6.42-10.25h0a3.19,3.19,0,0,1-1.42.34H42a3.2,3.2,0,0,1-1.43-.34h0C37.88,14.05,34.5,18.61,34,21.94ZM47.62,2.79a12.1,12.1,0,0,0-7,.06h0l.16.31,1.06,2,.23.42h4.38l.22-.42,1.22-2.25h0ZM40,17.23h0l2.8,3.65H40.45v1h3V23h-3v1h3v2.56H45V24.06h3v-1H45V22h3V21H45.62v-.06l2.55-3.32.25-.31h-2L44.35,20l-.11.13h0l-2.26-3H40ZM39,38.56H29.38a9.93,9.93,0,0,1,.37,2.66,9.69,9.69,0,0,1-.05,1.07c.77.74,1.56,1.54,2.34,2.4h7l-2.6-3.06L38,39.75Zm-.63,21.75a16.15,16.15,0,0,1-3.79,12.86c-2.4,2.71-7,5.94-15.14,6l-3.15,0-3.21-.5h0a25.92,25.92,0,0,1-5.28-2.26h0a15.79,15.79,0,0,1-7.66-16C.88,54.48,6,47.14,10.8,42.79h0a5.66,5.66,0,0,1-.2-1.47,5.56,5.56,0,0,1,1.81-4.14h0l-1.6-2.94a3,3,0,0,1-.18-2.55A2.89,2.89,0,0,1,12.42,30a21.08,21.08,0,0,1,13.72,0,3,3,0,0,1,1.61,4.29l-1.59,2.93h0A5.66,5.66,0,0,1,28,41.32c0,.25,0,.51-.06.76a3,3,0,0,1-.14.72h0c4.79,4.33,9.92,11.66,10.64,17.51ZM15,41.31a1.13,1.13,0,0,0,1,1.2h6.67a.91.91,0,0,0,.54-.19,1.2,1.2,0,0,0,.45-.85v-.16a1.31,1.31,0,0,0-.23-.79.9.9,0,0,0-.56-.39.38.38,0,0,0-.21,0H16a.89.89,0,0,0-.76.44,1.22,1.22,0,0,0-.25.74ZM4.46,60.84c-.87,7.13,3.68,14,14.82,14S35,68,34.09,60.84c-.6-4.86-5.53-11.53-9.39-15h0a4.81,4.81,0,0,1-2.07.49H16a4.54,4.54,0,0,1-2.08-.51h0C10,49.31,5,56,4.46,60.84Zm19.78-28a17.75,17.75,0,0,0-10.26.1h0l.24.45,1.54,2.85.33.62h6.4l.33-.62L24.6,33h0ZM13.12,54h0l4.09,5.33.05.06h-3.5v1.42h4.4v1.61h-4.4v1.44h4.4V67.6H20.4V63.93h4.41V62.47H20.4V60.86h4.41V59.41H21.32l.06-.09,3.73-4.85.35-.45H22.59L19.46,58.1l-.16.2h0L16,54ZM87.35,38.6H77.72A9.91,9.91,0,0,1,78,41.2a9.55,9.55,0,0,1,0,1.07c.77.74,1.56,1.54,2.34,2.4h7l-2.6-3.06,1.57-1.86Zm-.63,21.75a16.14,16.14,0,0,1-3.79,12.86c-2.39,2.71-7,5.94-15.14,6l-3.15-.11-3.2-.5h0a25.69,25.69,0,0,1-5.26-2.24h0a15.7,15.7,0,0,1-3.88-3.19,16.1,16.1,0,0,1-3.78-12.86c.71-5.83,5.84-13.17,10.63-17.52h0a5.66,5.66,0,0,1-.2-1.47,5.56,5.56,0,0,1,1.81-4.14h0l-1.6-2.94A3,3,0,0,1,59,31.69,2.87,2.87,0,0,1,60.77,30a21.08,21.08,0,0,1,13.72,0,2.92,2.92,0,0,1,1.77,1.72,3,3,0,0,1-.16,2.57l-1.59,2.93h0a5.66,5.66,0,0,1,1.79,4.15,4.87,4.87,0,0,1-.06.76,4.57,4.57,0,0,1-.14.72h0C80.87,47.13,86,54.46,86.72,60.31Zm-23.45-19a1.13,1.13,0,0,0,1,1.2h6.67a1,1,0,0,0,.54-.19,1.24,1.24,0,0,0,.45-.85v-.16a1.39,1.39,0,0,0-.24-.79.9.9,0,0,0-.55-.39.37.37,0,0,0-.21,0H64.29a.89.89,0,0,0-.77.44,1.24,1.24,0,0,0-.25.7ZM52.79,60.84c-.87,7.13,3.69,14,14.83,14s15.69-6.86,14.81-14C81.82,56,76.9,49.31,73,45.84h0a5,5,0,0,1-2.07.49H64.29a4.41,4.41,0,0,1-2.08-.51h0C58.35,49.31,53.41,56,52.79,60.84Zm19.78-28a17.75,17.75,0,0,0-10.26.1h0l.24.45,1.55,2.85.32.62h6.41l.32-.62L72.93,33h0ZM61.45,54h0l4.1,5.33v.06H62.1v1.42h4.4v1.61H62.1v1.44h4.4V67.6h2.23V63.93h4.41V62.47H68.73V60.86h4.41V59.41H69.65l.06-.09,3.73-4.85L73.8,54H70.92L67.79,58.1l-.15.2h0L64.31,54Z"/></svg>
            増やす
          </h1>
          <?php
            $tag_posts = get_posts(array(
                'post_type' => 'post',
                'tag'    => 'increase',
                'posts_per_page' => -1,
                'order' => 'ASC' // 昇順・降順
            ));
            global $post;
            ?>
          <div class="archive__speakerInfo">
            <?php if ($tag_posts): foreach ($tag_posts as $post): setup_postdata($post); ?>
            <div class="archive__speaker">
              <img src="<?php the_post_thumbnail_url(); ?>" class="archive__speakerImage" />
              <span class="archive__speakerPosition"><?php the_field('speaker_position'); ?></span>
              <p class="archive__speakerName"><?php the_field('speaker_name'); ?></p>
            </div>
            <?php endforeach; endif; wp_reset_postdata(); ?>
          </div>
        </div>
        <div class="archive__tagBlock">
          <h1 class="archive__tagName -attract">
            <svg id="_10" data-name="10" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 433.33"><title>icon_attract</title><path class="svg_attract" d="M424.38,361.07a49.79,49.79,0,0,0-40-37.87l-.2-.05a52.21,52.21,0,0,0-8.15-.69l-.36,0h-.46c-.87,0-1.72-.13-2.6-.08h-.36l-22.61,2.31-8.91.85a40.35,40.35,0,0,0,1.37-18.38,41.29,41.29,0,0,0-13.17-24.21l-43.75-39.07a72.9,72.9,0,0,0-61.39-17.49L139.84,241a44,44,0,0,0-13.39,4.53,23.16,23.16,0,0,0-12.25-6.68.7.7,0,0,0-.14,0,23,23,0,0,0-4.63-.48h-.09l-.21,0a24.44,24.44,0,0,0-3.31.08l-44.41,6.88a33,33,0,0,0-14.27-5.84l-.14,0a32.84,32.84,0,0,0-10.39-.14L0,245V387l0,22H0v.16l61.39-9.52a33.2,33.2,0,0,0,21.88-13.24l44.41-6.95a23,23,0,0,0,14.85-8.7,43.64,43.64,0,0,0,14.49.51l25.6-3.51,46,48.43a55.43,55.43,0,0,0,44.78,17l.29-.08L380,422.23a50.35,50.35,0,0,0,35-18.87,50.91,50.91,0,0,0,10.1-38.63C424.89,363.49,424.67,362.24,424.38,361.07ZM377,388.14,270.44,399a21.1,21.1,0,0,1-17-6.51l-49.83-52.39a23.3,23.3,0,0,0-20-7.09l-31.17,4.24a10.46,10.46,0,0,1-7.68-2.05l-7.76-50a10.62,10.62,0,0,1,8.71-10.54l84-14.56a38.79,38.79,0,0,1,32.63,9.37l43.75,39a6.59,6.59,0,0,1,2.13,4,6.4,6.4,0,0,1-.59,3.81,16.44,16.44,0,0,1-17.48,9.17c-.31-.05-.63-.09-.94-.15a16.68,16.68,0,0,1-3.08-1l-.44-.23a16.62,16.62,0,0,1-2.93-1.74l-22.17-16.82a8.32,8.32,0,0,0-12.73,3.36l-1.32,2.92a7.94,7.94,0,0,0-.59,4.69,8.47,8.47,0,0,0,2,4.31l32.56,35.49A20.72,20.72,0,0,0,297.22,363l77.41-6.36A15.76,15.76,0,0,1,391,368.75c.07.44.15.81.22,1.17A15.84,15.84,0,0,1,377,388.14Zm-265-40.9L87.75,351,76.41,277.66l24.14-3.73,2.27,14.49,9.08,58.38Z"/><path class="svg_attract" d="M506.56,74,494,72.26h0l-.16,0L475.92,199.39a6.45,6.45,0,0,1-7.21,5.36L232.8,171.32l-.54-.08h0l-.16,0L230,185.94a6.31,6.31,0,0,0,5.36,7.12l249.33,35.29a6.43,6.43,0,0,0,7.21-5.36l20-141.79A6.29,6.29,0,0,0,506.56,74Z"/><polygon class="svg_attract" points="353.16 75.2 351.56 76.72 350.76 77.52 347.24 81.04 346.23 81.97 346.12 82.06 342.92 76.4 342.36 75.44 341.32 73.52 332.52 57.91 323.48 56.63 319.96 56.12 318.09 55.76 318.15 55.85 318.04 55.84 317.96 55.84 328.12 73.84 328.36 74.32 328.44 74.32 334.84 85.68 335 86.08 335.03 86.15 335.04 86.24 317.7 83.79 317.63 83.78 317.63 83.78 317.48 83.76 316.46 90.94 316.46 90.96 316.46 90.96 316.43 91.12 338.68 94.24 337.48 102.4 315.61 99.34 315.39 99.3 315.39 99.31 315.24 99.28 314.23 106.41 314.22 106.49 314.22 106.49 314.2 106.65 336.44 109.77 333.8 128.65 345.08 130.25 345.08 130.09 346.12 122.73 347.72 111.37 354.69 112.33 369.25 114.41 369.97 114.49 371.01 107.29 371.01 107.2 364.69 106.33 350.12 104.17 349 102.24 349.96 95.84 359.49 97.2 372.21 98.96 373.25 91.76 373.25 91.68 362.2 90.08 360.76 89.87 356.04 88.65 365.33 79.6 365.73 79.2 374.85 70.24 379.29 65.93 380.43 64.87 380.38 64.87 380.45 64.8 380.45 64.71 365.89 62.64 353.16 75.2"/><path class="svg_attract" d="M208.73,154.42l6.24.88,19,2.72,48.17,6.8,165.63,23.44,10.33,1.44a6.31,6.31,0,0,0,7.12-5.35l1.2-8.73,7.92-56,7-49.21,3-20.89,1-7a6.3,6.3,0,0,0-5.35-7.12L230.58.06a6.32,6.32,0,0,0-7.13,5.36L203.37,147.3A6.31,6.31,0,0,0,208.73,154.42Zm244-62.5-6.24,44.41a29.2,29.2,0,0,0-14.81,3.52,28.5,28.5,0,0,0-5.36,3.76,29.22,29.22,0,0,0-9.2,14.73l-43-6.08-11.28-1.61L262.59,136.49l-5.85-.8a29.91,29.91,0,0,0-15.76-27c-.7-.37-1.52-.55-2.26-.86s-1.81-.74-2.79-1.07c-.41-.13-.78-.36-1.19-.47l7.44-52.89a26.63,26.63,0,0,0,6.72-.64,29.49,29.49,0,0,0,18.65-12.64,28.37,28.37,0,0,0,4-8.8L431.9,54.07a28.84,28.84,0,0,0,1.36,9.52,29.6,29.6,0,0,0,20.65,19.85Z"/><polygon class="svg_attract" points="254.88 79.97 254.1 79.86 254.1 79.86 253.94 79.84 253.38 84.24 283.71 88.56 305.15 91.6 305.79 87.28 305.79 87.2 288.99 84.8 254.88 79.97"/><polygon class="svg_attract" points="382.88 102.38 382.87 102.4 382.87 102.4 382.85 102.56 390.21 103.6 404.78 105.69 434.62 109.93 435.26 105.61 435.26 105.52 383.49 98.16 382.88 102.38"/></svg>
            引き寄せる
          </h1>
          <?php
            $tag_posts = get_posts(array(
                'post_type' => 'post',
                'tag'    => 'attract',
                'posts_per_page' => -1,
                'order' => 'ASC' // 昇順・降順
            ));
            global $post;
            ?>
          <div class="archive__speakerInfo">
            <?php if ($tag_posts): foreach ($tag_posts as $post): setup_postdata($post); ?>
            <div class="archive__speaker">
              <img src="<?php the_post_thumbnail_url(); ?>" class="archive__speakerImage" />
              <span class="archive__speakerPosition"><?php the_field('speaker_position'); ?></span>
              <p class="archive__speakerName"><?php the_field('speaker_name'); ?></p>
            </div>
            <?php endforeach; endif; wp_reset_postdata(); ?>
          </div>
        </div>
      </section>
      <div class="archive_pager">
        <div><?php previous_posts_link('前のページ'); ?></div>
        <div><?php next_posts_link('次のページ'); ?></div>
      </div>
    </div>
    <?php get_sidebar(); ?>
  </div>
</div>
<?php get_footer(); ?>